Config/InformationRegisters/IssuedHotelProducts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>IssuedHotelProducts</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Customer</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Contract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Contracts</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>GuestGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GuestGroups</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ParentDoc</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Accommodation</v8:Type>
						<v8:Type>cfg:DocumentRef.Reservation</v8:Type>
						<v8:Type>cfg:DocumentRef.Folio</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RoomQuota</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomQuotas</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BillOfShipment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RoomType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomTypes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>VATRate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VATRates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FixPlannedPeriod</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FixProductPeriod</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FixProductCost</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>HotelProductParent</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HotelProducts</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SocialGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SocialGroups</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CheckInDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CheckOutDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CurrencyExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ExchangeRateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Service</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ProductCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/HotelProducts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>HotelProducts</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomQuota</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomQuotas</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Clients</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FixedClient</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckInDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Duration</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckOutDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FixProductPeriod</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FixPlannedPeriod</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FixProductCost</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Sum</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DurationCalculationRuleType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DurationCalculationRuleTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReferenceHour</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Service</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Services</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentSection</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentSections</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentMethod</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PaymentMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SocialGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SocialGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseVaucherTypeCodeAsVaucherSeries</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SeriesSplitter</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SeriesIsAtTheEnd</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OpenNewProductForm</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreateDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeletionMarkDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeletionMarkAuthor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/HotelProductSales/Ext/Module.bsl
// -----------------------------------------------------------------------------
// Description: Returns value table with all hotel products
// Parameters: Hotel products folder to return products from, Maximum number of 
//             products to return, return items and folders or items only
// Return value: Value table
// -----------------------------------------------------------------------------
Function cmGetAllHotelProducts(pHotelProductFolder = Undefined, pTop = 0, pShowFolders = False) Export
	// Build and run query
	vQry = New Query;
	vQry.Text = 
	"SELECT " + ?(pTop = 0, "", "TOP " + pTop) + "
	|	HotelProducts.Ref AS HotelProduct
	|FROM
	|	Catalog.HotelProducts AS HotelProducts
	|WHERE 
	|	HotelProducts.DeletionMark = FALSE " + 
		?(Not pShowFolders, " AND HotelProducts.IsFolder = FALSE ", "") +
		?(ValueIsFilled(pHotelProductFolder), " AND HotelProducts.Ref IN HIERARCHY(&qHotelProductFolder) ", "") + "
	|ORDER BY HotelProducts.Code";
	vQry.SetParameter("qHotelProductFolder", pHotelProductFolder);
	vList = vQry.Execute().Unload();
	Return vList;
EndFunction // cmGetAllHotelProducts

// -----------------------------------------------------------------------------
// Description: Returns value table with all hotel product folders
// Parameters: Hotel products folder to return folders from, Maximum number of 
//             product folders to return
// Return value: Value table
// -----------------------------------------------------------------------------
Function cmGetAllHotelProductFolders(pHotelProductFolder = Undefined, pTop = 0) Export
	// Build and run query
	vQry = New Query;
	vQry.Text = 
	"SELECT " + ?(pTop = 0, "", "TOP " + pTop) + "
	|	HotelProducts.Ref AS HotelProduct
	|FROM
	|	Catalog.HotelProducts AS HotelProducts
	|WHERE 
	|	HotelProducts.IsFolder = TRUE AND " +
		?(ValueIsFilled(pHotelProductFolder), "HotelProducts.Ref IN HIERARCHY(&qHotelProductFolder) AND ", "") + "
	|	HotelProducts.DeletionMark = FALSE
	|ORDER BY HotelProducts.Code";
	vQry.SetParameter("qHotelProductFolder", pHotelProductFolder);
	vList = vQry.Execute().Unload();
	Return vList;
EndFunction // cmGetAllHotelProductFolders

// -----------------------------------------------------------------------------
// Description: Returns value table with all social group items
// Parameters: Social group folder to return items from, Maximum number of 
//             items to return
// Return value: Value table
// -----------------------------------------------------------------------------
Function cmGetAllSocialGroups(pSocialGroupFolder = Undefined, pTop = 0) Export
	// Build and run query
	vQry = New Query;
	vQry.Text = 
	"SELECT " + ?(pTop = 0, "", "TOP " + pTop) + "
	|	SocialGroups.Ref AS SocialGroup
	|FROM
	|	Catalog.SocialGroups AS SocialGroups
	|WHERE 
	|	SocialGroups.IsFolder = FALSE AND " +
		?(ValueIsFilled(pSocialGroupFolder), "SocialGroups.Ref IN HIERARCHY(&qSocialGroupFolder) AND ", "") + "
	|	SocialGroups.DeletionMark = FALSE
	|ORDER BY SocialGroups.Code";
	vQry.SetParameter("qSocialGroupFolder", pSocialGroupFolder);
	vList = vQry.Execute().Unload();
	Return vList;
EndFunction // cmGetAllSocialGroups

// -----------------------------------------------------------------------------
// Description: Returns value table with hotel product items
// Parameters: Hotel product code, Hotel, Maximum number of 
//             products to return
// Return value: Value table
// -----------------------------------------------------------------------------
Function cmGetHotelProductsList(pCode, pHotel, pMaxNumber = 10, pShowDeleted = False) Export
	// Build and run query
	qGetList = New Query;
	qGetList.Text = 
	"SELECT DISTINCT TOP " + pMaxNumber + "
	|	HotelProducts.Code,
	|	HotelProducts.Description,
	|	HotelProducts.Ref
	|FROM
	|	Catalog.HotelProducts AS HotelProducts
	|WHERE
	|	HotelProducts.Hotel = &qHotel AND 
	|	HotelProducts.Code = &qCode AND 
	|	HotelProducts.IsFolder = False AND
	|	(NOT &qShowDeleted AND NOT HotelProducts.DeletionMark OR &qShowDeleted)
	|ORDER BY Description";
	qGetList.SetParameter("qHotel", pHotel);
	qGetList.SetParameter("qCode", TrimAll(pCode));
	qGetList.SetParameter("qShowDeleted", pShowDeleted);
	vList = qGetList.Execute().Unload();
	Return vList;
EndFunction // cmGetHotelProductsList

// -----------------------------------------------------------------------------
// Description: Processes text edit end event in the hotel product controls
// Parameters: Object, Form, Hotel product control, Text entered, Value to return, 
//             Standard processing flag 
// Return value: True if hotel product was changed, False if not
// -----------------------------------------------------------------------------
Function cmHotelProductTextEditEnd(pObject, pForm, pControl, pText, pValue, pStandardProcessing, pBaseObject = Undefined, rMessage = "") Export
	vIsChanged = False;
	pStandardProcessing = False;
	vText = Upper(TrimAll(pText));
	vTab = cmGetHotelProductsList(vText, ?(pObject <> Undefined, pObject.Hotel, SessionParameters.CurrentHotel), 10, True);
	If vTab.Count() > 0 Then
		vRow = vTab.Get(0);
		vHPRef = vRow.Ref;
		If TypeOf(pObject) = Type("DocumentObject.Accommodation") Or
		   TypeOf(pObject) = Type("DocumentObject.Reservation") Or
		   TypeOf(pObject) = Type("DocumentObject.Charge") Or
		   TypeOf(pObject) = Type("FormDataStructure") Or
		   TypeOf(pObject) = Type("Structure") Then
			If vHPRef.DeletionMark Then
				rMessage = NStr("en='This product was already deleted!'; de='Dieser Reisecheck/Kurkarte ist schon löschen!'; ru='Эта путевка/курсовка испорчена!'");
			Else
				rMessage = NStr("en='This product was already registered';ru='Эта путевка/курсовка уже зарегистрирована';de='Dieser Reisecheck/Kurkarte ist schon registriert'");
			EndIf;
			If TypeOf(pObject) <> Type("Structure") Then
				tcCommonFunctionOnClientServer.TextMessage(rMessage, MessageStatus.Attention);
			EndIf;
		EndIf;
		If TypeOf(pObject) = Type("DocumentObject.Accommodation") Or
		   TypeOf(pObject) = Type("DocumentObject.Reservation") Or
		   TypeOf(pObject) = Type("FormDataStructure") Or
		   TypeOf(pObject) = Type("Structure") Then
			If vHPRef.FixProductCost Then
				If vHPRef.Duration > 0 And vHPRef.Sum > 0 And 
				   (Not ValueIsFilled(vHPRef.CheckInDate) Or Not ValueIsFilled(vHPRef.CheckInDate)) Then
					vHPObj = vHPRef.GetObject();
					vReferenceHour = '00010101';
					If ValueIsFilled(pObject.RoomRate) Then
						vReferenceHour = pObject.RoomRate.ReferenceHour;
					EndIf;
					vHPObj.CheckInDate = BegOfDay(pObject.CheckInDate) + (vReferenceHour - BegOfDay(vReferenceHour));
					vHPObj.CheckOutDate = vHPObj.CheckInDate + vHPObj.Duration*24*3600;
					If vReferenceHour = '00010101' Then
						vHPObj.CheckOutDate = vHPObj.CheckOutDate - 1;
					EndIf;
					vHPObj.Write();
				EndIf;
			EndIf;
		EndIf;
		pValue = vHPRef;
		vIsChanged = True;
	Else
		Try
			// Try to find issued hotel product in the information register
			vQry = New Query();
			vQry.Text = 
			"SELECT
			|	IssuedHotelProducts.Recorder,
			|	IssuedHotelProducts.LineNumber,
			|	IssuedHotelProducts.Active,
			|	IssuedHotelProducts.ProductCode,
			|	IssuedHotelProducts.Hotel,
			|	IssuedHotelProducts.Company,
			|	IssuedHotelProducts.Customer,
			|	IssuedHotelProducts.Contract,
			|	IssuedHotelProducts.GuestGroup,
			|	IssuedHotelProducts.ParentDoc,
			|	IssuedHotelProducts.RoomQuota,
			|	IssuedHotelProducts.BillOfShipment,
			|	IssuedHotelProducts.VATRate,
			|	IssuedHotelProducts.FixProductPeriod,
			|	IssuedHotelProducts.FixPlannedPeriod,
			|	IssuedHotelProducts.FixProductCost,
			|	IssuedHotelProducts.HotelProductParent,
			|	IssuedHotelProducts.CheckInDate,
			|	IssuedHotelProducts.Duration,
			|	IssuedHotelProducts.CheckOutDate,
			|	IssuedHotelProducts.Price,
			|	IssuedHotelProducts.Currency
			|FROM
			|	InformationRegister.IssuedHotelProducts AS IssuedHotelProducts
			|WHERE
			|	IssuedHotelProducts.ProductCode = &qProductCode
			|	AND IssuedHotelProducts.Hotel = &qHotel
			|ORDER BY
			|	IssuedHotelProducts.Recorder.PointInTime DESC";
			vQry.SetParameter("qProductCode", vText);
			vQry.SetParameter("qHotel", pObject.Hotel);
			vIHPs = vQry.Execute().Unload();
			If vIHPs.Count() > 0 Then
				vIHPRow = vIHPs.Get(0);
				// Create and return new hotel product filled with data from the issued one
				vHPObj = Catalogs.HotelProducts.CreateItem();
				vHPObj.CreateDate = CurrentSessionDate();
				vHPObj.Author = SessionParameters.CurrentUser;
				vHPObj.Code = TrimAll(vIHPRow.ProductCode);
				vHPObj.Description = TrimAll(vHPObj.Code);
				FillPropertyValues(vHPObj, vIHPRow);
				vHPObj.Parent = vIHPRow.HotelProductParent;
				vHPObj.Sum = vIHPRow.Price;
				vHPObj.Write();
				pValue = vHPObj.Ref;
				vIsChanged = True;
			Else
				// If there are hotel product folders then ask user to choose one
				vHPFolder = Undefined;
				// Try to get hotel product type from the room rate
				If TypeOf(pObject) = Type("DocumentObject.Accommodation") Or
				   TypeOf(pObject) = Type("DocumentObject.Reservation") Or
				   TypeOf(pObject) = Type("FormDataStructure") Or
				   TypeOf(pObject) = Type("Structure") Then
					If ValueIsFilled(pObject.RoomRate) Then
						vHPFolder = pObject.RoomRate.HotelProductType;
					EndIf;
				EndIf;					
				#IF CLIENT THEN
					If Not ValueIsFilled(vHPFolder) Then
						vHPFolders = cmGetAllHotelProductFolders();
						If vHPFolders.Count() > 0 Then
							vHPFolder = Catalogs.HotelProducts.GetFolderChoiceForm().DoModal();
							If vHPFolder = Undefined Then
								Return vIsChanged;
							EndIf;
						EndIf;
					EndIf;
				#ENDIF
				// If there are social groups then ask user to choose one if necessary
				vSocialGroup = Undefined;
				#IF CLIENT THEN
					vSocialGroups = cmGetAllSocialGroups();
					If vSocialGroups.Count() > 0 Then
						vSocialGroup = Catalogs.SocialGroups.GetChoiceForm().DoModal();
						If vSocialGroup = Undefined Then
							Return vIsChanged;
						EndIf;
					EndIf;
				#ENDIF
				// Create and return new hotel product
				vHPObj = Catalogs.HotelProducts.CreateItem();
				vHPObj.CreateDate = CurrentSessionDate();
				vHPObj.Author = SessionParameters.CurrentUser;
				vHPObj.Code = Upper(TrimAll(pText));
				vHPObj.Description = Upper(TrimAll(pText));
				vHPObj.Hotel = ?(pObject <> Undefined, pObject.Hotel, SessionParameters.CurrentHotel);
				vHPObj.Currency = vHPObj.Hotel.FolioCurrency;
				vHPObj.SocialGroup = vSocialGroup;
				If ValueIsFilled(vHPFolder) Then
					vHPObj.Parent = vHPFolder;
					vHPObj.RoomQuota = vHPFolder.RoomQuota;
					vHPObj.FixProductCost = vHPFolder.FixProductCost;
					vHPObj.FixProductPeriod = vHPFolder.FixProductPeriod;
					vHPObj.FixPlannedPeriod = vHPFolder.FixPlannedPeriod;
				EndIf;
				If TypeOf(pObject) = Type("DocumentObject.Accommodation") Or
				   TypeOf(pObject) = Type("DocumentObject.Reservation") Or
				   TypeOf(pObject) = Type("Structure") Then
					vHPObj.Client = pObject.Guest;
					vHPObj.Duration = pObject.Duration;
					If vHPObj.FixProductCost Then
						vReferenceHour = '00010101';
						If ValueIsFilled(pObject.RoomRate) Then
							vReferenceHour = pObject.RoomRate.ReferenceHour;
						EndIf;
						vHPObj.CheckInDate = BegOfDay(pObject.CheckInDate) + (vReferenceHour - BegOfDay(vReferenceHour));
						vHPObj.CheckOutDate = vHPObj.CheckInDate + vHPObj.Duration*24*3600;
						If vReferenceHour = '00010101' Then
							vHPObj.CheckOutDate = vHPObj.CheckOutDate - 1;
						EndIf;
					Else
						vHPObj.CheckInDate = pObject.CheckInDate;
						vHPObj.CheckOutDate = pObject.CheckOutDate;
					EndIf;
					vHPObj.Sum = 0;
					For Each vSrvRow In pObject.Services Do
						If ValueIsFilled(vSrvRow.Service) And vSrvRow.Service.IsHotelProductService Then
							vHPObj.Sum = vHPObj.Sum + vSrvRow.Sum - vSrvRow.DiscountSum;
						EndIf;
					EndDo;
					// If document product is filled then copy it's parameters
					If pBaseObject <> Undefined And ValueIsFilled(pBaseObject.HotelProduct) And pBaseObject.HotelProduct.Parent = vHPObj.Parent And 
					   pBaseObject.RoomType = pObject.RoomType And pBaseObject.AccommodationType = pObject.AccommodationType And pBaseObject.Duration = pObject.Duration Then
						vBaseProduct = pBaseObject.HotelProduct;
						If vBaseProduct.FixProductPeriod Then
							vHPObj.FixProductPeriod = True;
							vHPObj.CheckInDate = vBaseProduct.CheckInDate;
							vHPObj.CheckOutDate = vBaseProduct.CheckOutDate;
						EndIf;
						If vBaseProduct.FixPlannedPeriod Then
							vHPObj.FixPlannedPeriod = True;
							vHPObj.CheckInDate = vBaseProduct.CheckInDate;
							vHPObj.CheckOutDate = vBaseProduct.CheckOutDate;
						EndIf;
						If vBaseProduct.FixProductCost Then
							vHPObj.FixProductCost = True;
							vHPObj.CheckInDate = vBaseProduct.CheckInDate;
							vHPObj.CheckOutDate = vBaseProduct.CheckOutDate;
							vHPObj.Sum = vBaseProduct.Sum;
							vHPObj.Currency = vBaseProduct.Currency;
						EndIf;
					EndIf;
				ElsIf TypeOf(pObject) = Type("DocumentObject.Folio") Then
					vHPObj.Client = pObject.Client;
				ElsIf TypeOf(pObject) = Type("DocumentObject.Charge") And ValueIsFilled(pObject.Folio) Then
					vHPObj.Client = pObject.Folio.Client;
				EndIf;
				vHPObj.Write();
				pValue = vHPObj.Ref;
				vIsChanged = True;
			EndIf;
		Except
		EndTry;
	EndIf;
	If vIsChanged And ValueIsFilled(pValue) Then
		If ValueIsFilled(pValue.Parent) Then
			If pValue.Parent.OpenNewProductForm Then
				vFrm = pValue.GetForm(, pControl);
				vFrm.Open();
			EndIf;
		EndIf;
	EndIf;
	Return vIsChanged;
EndFunction // cmHotelProductTextEditEnd
